{"paper_id": "000affa746a03f1fe4e3b3ef1a62fdfa9b9ac52a", "metadata": {"title": "Correlation between antimicrobial consumption and incidence of health-care- associated infections due to methicillin- resistant Staphylococcus aureus and vancomycin-resistant enterococci at a university hospital in Taiwan from 2000 to 2010", "authors": [{"first": "Chih-Cheng", "middle": [], "last": "Lai", "suffix": "", "affiliation": {"laboratory": "", "institution": "Chi Mei Medical Center", "location": {"settlement": "Liouying, Tainan", "country": "Taiwan"}}, "email": ""}, {"first": "Chen-Chen", "middle": [], "last": "Chu", "suffix": "", "affiliation": {"laboratory": "", "institution": "National Taiwan University Hospital", "location": {"settlement": "Taipei", "country": "Taiwan"}}, "email": ""}, {"first": "Aristine", "middle": [], "last": "Cheng", "suffix": "", "affiliation": {"laboratory": "", "institution": "New Taipei City", "location": {"country": "Taiwan"}}, "email": ""}, {"first": "Yu-Tsung", "middle": [], "last": "Huang", "suffix": "", "affiliation": {"laboratory": "", "institution": "New Taipei City", "location": {"country": "Taiwan"}}, "email": ""}, {"first": "Po-Ren", "middle": [], "last": "Hsueh", "suffix": "", "affiliation": {"laboratory": "", "institution": "National Taiwan University College of Medicine", "location": {"settlement": "Taipei", "country": "Taiwan"}}, "email": ""}]}, "abstract": [{"text": "Objectives: This study was conducted to investigate the correlation between antibiotic consumption and the incidence of health-care-associated infections (HCAIs) caused by methicillin-resistant Staphylococcus aureus (MRSA) (HCAI-MRSA) and vancomycin-resistant enterococci (VREs) (HCAI-VREs) at a university hospital in Taiwan during the period from 2000 to 2010. Methods: Data on annual patient-days and annual consumption (defined daily dose/1000 patient-days) of glycopeptides (vancomycin and teicoplanin), linezolid, fusidic acid, tigecycline, and daptomycin were analyzed. Yearly aggregated data on the number of nonduplicate clinical MRSA and VRE isolates causing HCAI were collected.", "cite_spans": [], "ref_spans": [], "section": "Abstract"}, {"text": "Journal of Microbiology, Immunology and Infection (2015) 48, 431e436 aureus;", "cite_spans": [], "ref_spans": [], "section": "Abstract"}, {"text": "Results: Overall, the consumption of teicoplanin and linezolid significantly increased during the study period. A significant decrease in the incidence of HCAI-MRSA and a significant increase in the incidence of HCAI-VRE were found during the study period. A significant correlation was found between the increased use of teicoplanin and linezolid and the decreased incidence of HCAI-MRSA. By contrast, positive correlations were found between the consumption of teicoplanin and tigecycline and the incidence of HCAI-VRE.", "cite_spans": [], "ref_spans": [], "section": "Abstract"}, {"text": "Conclusion: This study identified various correlations between the consumption of antibiotics and the incidence of HCAI-MRSA and HCAI-VRE. Strict implementation of infection-control guidelines and reinforcement of administering appropriate antibiotic agents would be helpful in decreasing the incidence of MRSA and VRE in hospitals.", "cite_spans": [], "ref_spans": [], "section": "Abstract"}], "body_text": [{"text": "The incidence of health-care-associated infection (HCAI) caused by multidrug-resistant bacteria has gradually risen during the last decade, especially in immunocompromised patients. 1, 2 The most common causative agents of HCAI in the United States are the Gram-positive bacteria Staphylococcus aureus and Enterococcus. 3 Methicillin (oxacillin)resistant S. aureus (MRSA) is of particular concern because patients with MRSA infection tend to have higher mortality rates, longer hospital stays, and higher health-careassociated costs than patients with methicillin-susceptible S. aureus infections. 1, 4 In addition, DiazGranados et al 5 found that the mortality rate among patients with vancomycin-resistant enterococci (VREs) infection was significantly higher than that among patients with vancomycin-susceptible Enterococcus infections. Taiwan is no exception, and VRE and MRSA infections have become emerging infectious diseases. 6e10 Antibiotic use is one of the risk factors for antibiotic resistance among bacterial species; however, the nature of this relationship is complicated. Although several studies have examined the relationship between antimicrobial consumption and antibiotic resistance, the findings were inconsistent, possibly due to differences in resistance profiles as well as due to differences in antibiotic-prescribing practices in different countries. 11e18 In those studies, the use of glycopeptides, extended-spectrum cephalosporins, and fluoroquinolones was demonstrated to be associated with the prevalence of MRSA and VRE. 12e18 Few studies, however, have investigated the relationship between the use of linezolid or fusidic acid and the prevalence of MRSA and VRE. In addition, the association between the consumption of tigecycline, a novel anti-Gram-positive agent derived from minocycline that has been shown to be effective against many Gram-negative rods as well as Gram-positive cocci, and the prevalence of MRSA and VRE has never been studied. 19 Similarly, no studies have so far investigated the association between the prevalence of MRSA and VRE and the consumption of daptomycin, an anti-MRSA antibiotic that has been approved by the U.S. Food and Drug Administration for the treatment of complicated skin and skin-structure infections and bacteremia due to MRSA. 20, 21 In this study, we investigated the correlation between consumption of antibiotics, including vancomycin, teicoplanin, linezolid, tigecycline, fusidic acid, and daptomycin, and the incidence of HCAI-MRSA and HCAI-VRE during the period from 2000 to 2010 at a medical center in Taiwan.", "cite_spans": [{"start": 182, "end": 184, "text": "1,", "ref_id": "BIBREF0"}, {"start": 185, "end": 186, "text": "2", "ref_id": "BIBREF1"}, {"start": 320, "end": 321, "text": "3", "ref_id": "BIBREF2"}, {"start": 598, "end": 600, "text": "1,", "ref_id": "BIBREF0"}, {"start": 601, "end": 602, "text": "4", "ref_id": "BIBREF3"}, {"start": 635, "end": 636, "text": "5", "ref_id": "BIBREF4"}, {"start": 934, "end": 938, "text": "6e10", "ref_id": null}, {"start": 1379, "end": 1384, "text": "11e18", "ref_id": null}, {"start": 1985, "end": 1987, "text": "19", "ref_id": "BIBREF18"}, {"start": 2309, "end": 2312, "text": "20,", "ref_id": "BIBREF19"}, {"start": 2313, "end": 2315, "text": "21", "ref_id": "BIBREF20"}], "ref_spans": [], "section": "Introduction"}, {"text": "The National Taiwan University Hospital (NTUH) is a 2500bed, academically affiliated medical center that provides both primary and tertiary care in northern Taiwan. The number of annual inpatient-days at the hospital increased from 624,675 in 2000 to 763,772 in 2010. Linezolid and fusidic acid were introduced into the hospital formulary in 2002. Tigecycline and daptomycin have been prescribed at the NTUH since 2007 and 2009, respectively. Some of the data analyzed in this study were included in a previous study. 16, 17 Bacterial isolates Data on the susceptibilities of S. aureus to oxacillin were collected during the period from 2000 to 2010. These isolates were nonduplicate and isolates of each species from each patient recovered within 7 days were considered as a single isolate. Susceptibility testing for S. aureus and Enterococcus species followed the Clinical and Laboratory Standards Institute guidelines. 22 S. aureus ATCC 25923 was used as the control strain for routine disk-susceptibility testing. 22 Methicillin resistance among S. aureus isolates was routinely screened by measuring their growth on oxacillin (6 mg/L) in 2% NaCl-containing trypticase soy agar plate that had been incubated in ambient air at 35 C for 24 hours. 22, 23 Vancomycin resistance among Enterococcus species was confirmed by growth of the isolate on a brain heart infusion agar plate containing vancomycin (6 mg/L) that had been incubated in ambient air at 35 C for 24 hours. 22 ", "cite_spans": [{"start": 518, "end": 521, "text": "16,", "ref_id": "BIBREF15"}, {"start": 522, "end": 524, "text": "17", "ref_id": "BIBREF16"}, {"start": 923, "end": 925, "text": "22", "ref_id": "BIBREF21"}, {"start": 1019, "end": 1021, "text": "22", "ref_id": "BIBREF21"}, {"start": 1250, "end": 1253, "text": "22,", "ref_id": "BIBREF21"}, {"start": 1254, "end": 1256, "text": "23", "ref_id": null}, {"start": 1474, "end": 1476, "text": "22", "ref_id": "BIBREF21"}], "ref_spans": [], "section": "Hospital setting"}, {"text": "Yearly aggregated data on the number of nonduplicate clinical MRSA and VRE isolates causing HCAI were collected. HCAI was defined according to the National Nosocomial Infection Surveillance guidelines. 18 The incidence rates of HCAI-MRSA and HCAI-VRE were defined as the number of patients with HCAI-MRSA and HCAI-VRE, respectively, per 1000 inpatient-days.", "cite_spans": [{"start": 202, "end": 204, "text": "18", "ref_id": "BIBREF17"}], "ref_spans": [], "section": "Patients with HCAI-MRSA and HCAI-VRE"}, {"text": "Data on annual consumption [defined daily dose (DDD)/1000 inpatient-days] of glycopeptides (vancomycin and teicoplanin), linezolid, fusidic acid, tigecycline, and daptomycin from 2000 to 2010 were obtained from the pharmacy department of the hospital.", "cite_spans": [], "ref_spans": [], "section": "Antimicrobial agents and consumption"}, {"text": "Linear regression analysis was used to analyze the trends in annual consumption of antimicrobial agents and the trends in incidence of HCAI-MRSA and HCAI-VRE over time. The Pearson product moment correlation coefficient was used to determine the relationship between annual antibiotic consumption and trends in resistance. A p value < 0.05 was considered statistically significant.", "cite_spans": [], "ref_spans": [], "section": "Statistical analysis"}, {"text": "In general, the use of each antimicrobial agent varied over time (Table 1) . Overall, the consumption of teicoplanin and linezolid significantly increased, whereas the consumption of vancomycin, glycopeptides (including vancomycin and teicoplanin), tigecycline, and fusidic acid remained stable during the study period.", "cite_spans": [], "ref_spans": [{"start": 65, "end": 74, "text": "(Table 1)", "ref_id": "TABREF0"}], "section": "Annual antibiotic consumption"}, {"text": "Trend in HCAI due to MRSA and VRE and the incidence of HCAI-MRSA and HCAI-VRE during the period 2000e2010", "cite_spans": [], "ref_spans": [], "section": "Annual antibiotic consumption"}, {"text": "During the study period, a total of 4657 nonduplicate S. aureus isolates and 4219 enterococcal isolates causing HCAI were identified. Fig. 1A shows the trends in MRSA isolates and incidence of HCAI-MRSA. There was a significant decrease in the incidence of HCAI-MRSA over time. Fig. 1B shows the trends in VRE isolates and the incidence of HCAI-VRE. A significant rise in the incidence of HCAI-VRE over time was noted.", "cite_spans": [], "ref_spans": [{"start": 134, "end": 141, "text": "Fig. 1A", "ref_id": "FIGREF0"}, {"start": 278, "end": 285, "text": "Fig. 1B", "ref_id": "FIGREF0"}], "section": "Annual antibiotic consumption"}, {"text": "Data on the correlation between the incidence of HCAI-MRSA, the incidence of HCAI-VRE, and the annual consumption of vancomycin, teicoplanin, linezolid, fusidic acid, tigecycline, and daptomycin are shown in Tables 2  and 3 . A significant correlation was found between the increased use of linezolid and teicoplanin and the decreased prevalence of MRSA. By contrast, no significant correlation was found between the increased use of vancomycin, glycopeptides (vancomycin and teicoplanin), tigecycline, and fusidic acid and the incidence of HCAI-MRSA. There was, however, a positive correlation between the incidence of HCAI-VRE and the use of teicoplanin and tigecycline.", "cite_spans": [], "ref_spans": [{"start": 208, "end": 223, "text": "Tables 2  and 3", "ref_id": "TABREF1"}], "section": "Correlation between antibiotic consumption and incidence of HCAI-MRSA and HCAI-VRE"}, {"text": "This study evaluated the association between antibiotic consumption and the incidence of HCAI-MRSA and HCAI-VRE in a medical center in Taiwan during an 11-year period. . analyzed the disease density (per 1000 patient-days) due to resistant bacteria rather than resistance rate. This parameter (density) is now considered more appropriate to present the real situation. In addition, we evaluated two newly available antibiotics (tigecycline and daptomycin) and the relationship with disease density. Using this new analysis and adding some new data, we had several significant novel findings.", "cite_spans": [], "ref_spans": [], "section": "Discussion"}, {"text": "We found that the consumption of teicoplanin and linezolid significantly increased during the study period; however, the consumption of vancomycin, glycopeptides (both vancomycin and teicoplanin), and fusidic acid remained stable. It is speculated that physicians in the hospital are more likely to prescribe teicoplanin and linezolid than vancomycin for the treatment of MRSA infections because teicoplanin and linezolid are associated with fewer side effects, such as renal toxicity. In addition, the consumption of tigecycline increased from 1.8 DDD/1000 inpatient-days in 2007 to 6.0 DDD/1000 inpatient-days in 2010. However, although the consumption of both tigecycline and daptomycin increased over time, there was no significant association between the consumption of those antimicrobial agents and the incidence of nosocomial MRSA infections during the study period. Long-term studies are needed to evaluate the trend in HCAI-MRSA infections associated with the consumption of tigecycline and daptomycin.", "cite_spans": [], "ref_spans": [], "section": "Discussion"}, {"text": "Although the relationship between the incidence of MRSA and the use of b-lactam antibiotics and fluoroquinolones has been investigated, 11e14,24 few studies have focused on the association between consumption of glycopeptides, linezolid, and fusidic acid and the incidence of infection due to Gram-positive bacteria. 16, 17 In this study, we found that the incidence of infections due to MRSA significantly decreased from 0.6023/1000 inpatientdays in 2000 to 0.2108/1000 inpatient-days in 2010. In addition, we noted a negative correlation between the use of teicoplanin and linezolid and the incidence of HCAI-MRSA. Although further research is needed to clarify this association, our findings suggest that teicoplanin and linezolid might exert a protective effect against the emergence of MRSA. We also found that there was no significant correlation between the consumption of vancomycin, glycopeptides including vancomycin and teicoplanin, and fusidic acid and incidence of HCAI-MRSA, a finding that is consistent with that reported in our previous study. 17 In addition, the consumption of tigecycline and daptomycin was not associated with the incidence of HCAI-MRSA. The reason for that finding is most likely due to the short duration of tigecycline and daptomycin use in our hospital. A longer study period is needed to clarify the correlation between those two antimicrobial agents and the incidence of MRSA infections.", "cite_spans": [{"start": 317, "end": 320, "text": "16,", "ref_id": "BIBREF15"}, {"start": 321, "end": 323, "text": "17", "ref_id": "BIBREF16"}, {"start": 1060, "end": 1062, "text": "17", "ref_id": "BIBREF16"}], "ref_spans": [], "section": "Discussion"}, {"text": "Our data show that the incidence of HCAI-VRE significantly increased during the study period. We found that the increase in use of teicoplanin positively correlated with the increase in incidence of HCAI-VRE. This finding is consistent with that in our previous study. 17 By contrast, we found that there was a negative correlation between the use of teicoplanin and the incidence of HCAI-MRSA. Our data also show a positive correlation between the consumption of tigecycline and the incidence of HCAI-VRE. Although tigecycline was used for only 4 years in this study, the strong positive correlation between its use and the incidence of VRE infections implies that tigecycline should be administered with caution.", "cite_spans": [{"start": 269, "end": 271, "text": "17", "ref_id": "BIBREF16"}], "ref_spans": [], "section": "Discussion"}, {"text": "This study has several limitations. Although we found a significant correlation between antibiotic use and the incidence of HCAI-MRSA, the etiology behind the emergence of drug-resistant bacteria in our hospital is complicated and selective pressure from widespread use of antimicrobial agents might be only one of the causes. The prevalence of MRSA could have been affected by multiple factors such as infection-control measures and hand hygiene, or operational changes in the hospital. After the emergence of severe acute respiratory syndrome in 2003, the infection prevention and control program at the NTUH was upgraded to include hand hygiene, antibiotic-control policies, and an annual, intensive, project-based control program. In fact, it has been demonstrated that those policies are directly associated with the decrease in rates of HCAIs and bloodstream infections at the NTUH. 25 However, those effects were not measured in this study. Whether those policies had an impact on MRSA trends remains unknown. In addition, because this was an epidemiological surveillance study, we did not analyze the impact that duration of exposure to antibiotics, or clonal spread of resistant bacteria had on the trend in incidence of nosocomial MRSA infection. Furthermore, the overall DDD of a given antibiotic is a notoriously problematic denominator as there will be changes in low-dose usage in specific groups of patients (i.e., children and patients with renal insufficiency). Therefore, an analysis using number of prescriptions for those patient groups would be more appropriate. However, the impact should be limited in this study because those specific patient groups comprised only a small fraction of the study patients and the effect would be diluted and equal in each year.", "cite_spans": [{"start": 889, "end": 891, "text": "25", "ref_id": "BIBREF23"}], "ref_spans": [], "section": "Discussion"}, {"text": "In conclusion, in this 11-year study in a single medical institution, we found that the use of teicoplanin and linezolid significantly increased. Furthermore, we found a negative correlation between the usage of individual antibiotics, such as teicoplanin and linezolid, and the incidence of HCAI-MRSA. However, we also found a positive correlation between consumption of teicoplanin and tigecycline and the incidence of HCAI-VRE. Therefore, strict implementation of infection-control policies including administration of appropriate antimicrobial agents may be positively correlated with a decrease in the presence of MRSA in hospitals.", "cite_spans": [], "ref_spans": [], "section": "Discussion"}], "bib_entries": {"BIBREF0": {"ref_id": "b0", "title": "Epidemiology of multidrug-resistant bacteria in patients with long hospital stays", "authors": [{"first": "C", "middle": [], "last": "Buke", "suffix": ""}, {"first": "L", "middle": [], "last": "Armand-Lefevre", "suffix": ""}, {"first": "I", "middle": [], "last": "Lolom", "suffix": ""}, {"first": "W", "middle": [], "last": "Guerinot", "suffix": ""}, {"first": "C", "middle": [], "last": "Deblangy", "suffix": ""}, {"first": "R", "middle": [], "last": "Ruimy", "suffix": ""}], "year": 2007, "venue": "Infect Control Hosp Epidemiol", "volume": "28", "issn": "", "pages": "1255--60", "other_ids": {}}, "BIBREF1": {"ref_id": "b1", "title": "Antimicrobial susceptibility patterns of unusual nonfermentative Gram-negative bacilli isolated from Latin America: report from the SENTRY Antimicrobial Surveillance Program", "authors": [{"first": "A", "middle": ["C"], "last": "Gales", "suffix": ""}, {"first": "R", "middle": ["N"], "last": "Jones", "suffix": ""}, {"first": "S", "middle": ["S"], "last": "Andrade", "suffix": ""}, {"first": "H", "middle": ["S"], "last": "Sader", "suffix": ""}], "year": 2005, "venue": "Mem Inst Oswaldo Cruz", "volume": "100", "issn": "", "pages": "571--578", "other_ids": {}}, "BIBREF2": {"ref_id": "b2", "title": "NHSN annual update: antimicrobial-resistant pathogens associated with healthcare-associated infections: annual summary of data reported to the National Healthcare Safety Network at the Centers for Disease Control and Prevention", "authors": [{"first": "A", "middle": ["I"], "last": "Hidron", "suffix": ""}, {"first": "J", "middle": ["R"], "last": "Edwards", "suffix": ""}, {"first": "J", "middle": [], "last": "Patel", "suffix": ""}, {"first": "T", "middle": ["C"], "last": "Horan", "suffix": ""}, {"first": "D", "middle": ["M"], "last": "Sievert", "suffix": ""}, {"first": "D", "middle": ["A"], "last": "Pollock", "suffix": ""}], "year": 2008, "venue": "Infect Control Hosp Epidemiol", "volume": "29", "issn": "", "pages": "996--1011", "other_ids": {}}, "BIBREF3": {"ref_id": "b3", "title": "Guidelines for the treatment of methicillin-resistant Staphylococcus aureus infections in Taiwan", "authors": [{"first": "Y", "middle": ["S"], "last": "Chen", "suffix": ""}], "year": 2013, "venue": "J Microbiol Immunol Infect", "volume": "46", "issn": "", "pages": "147--50", "other_ids": {}}, "BIBREF4": {"ref_id": "b4", "title": "Comparison of mortality associated with vancomycin-resistant and vancomycin-susceptible enterococcal bloodstream infections: a meta-analysis", "authors": [{"first": "C", "middle": ["A"], "last": "Diazgranados", "suffix": ""}, {"first": "S", "middle": ["M"], "last": "Zimmer", "suffix": ""}, {"first": "M", "middle": [], "last": "Klein", "suffix": ""}, {"first": "J", "middle": ["A"], "last": "Jernigan", "suffix": ""}], "year": 2005, "venue": "Clin Infect Dis", "volume": "41", "issn": "", "pages": "327--360", "other_ids": {}}, "BIBREF5": {"ref_id": "b5", "title": "Emergence of vancomycin-resistant Enterococcus bloodstream infections in southern Taiwan", "authors": [{"first": "C", "middle": ["H"], "last": "Chou", "suffix": ""}, {"first": "N", "middle": ["Y"], "last": "Lee", "suffix": ""}, {"first": "H", "middle": ["C"], "last": "Lee", "suffix": ""}, {"first": "C", "middle": ["M"], "last": "Chang", "suffix": ""}, {"first": "C", "middle": ["C"], "last": "Lee", "suffix": ""}, {"first": "W", "middle": ["C"], "last": "Ko", "suffix": ""}], "year": 2012, "venue": "J Microbiol Immunol Infect", "volume": "45", "issn": "", "pages": "221--228", "other_ids": {}}, "BIBREF6": {"ref_id": "b6", "title": "Impact of vancomycin MIC creep on patients with methicillinresistant Staphylococcus aureus bacteremia", "authors": [{"first": "Y", "middle": ["C"], "last": "Yeh", "suffix": ""}, {"first": "K", "middle": ["M"], "last": "Yeh", "suffix": ""}, {"first": "T", "middle": ["Y"], "last": "Lin", "suffix": ""}, {"first": "S", "middle": ["K"], "last": "Chiu", "suffix": ""}, {"first": "Y", "middle": ["S"], "last": "Yang", "suffix": ""}, {"first": "Y", "middle": ["C"], "last": "Wang", "suffix": ""}], "year": 2012, "venue": "J Microbiol Immunol Infect", "volume": "45", "issn": "", "pages": "214--234", "other_ids": {}}, "BIBREF7": {"ref_id": "b7", "title": "The detection and clinical impact of vancomycin MIC among patients with methicillin-resistant Staphylococcus aureus bacteremia", "authors": [{"first": "C", "middle": ["H"], "last": "Huang", "suffix": ""}, {"first": "Y", "middle": ["H"], "last": "Chen", "suffix": ""}], "year": 2013, "venue": "J Microbiol Immunol Infect", "volume": "46", "issn": "", "pages": "315--321", "other_ids": {}}, "BIBREF8": {"ref_id": "b8", "title": "Molecular epidemiology and clinical characteristics of heteroresistant vancomycin intermediate Staphylococcus aureus bacteremia in a Taiwan Medical Center", "authors": [{"first": "S", "middle": ["Y"], "last": "Lin", "suffix": ""}, {"first": "T", "middle": ["C"], "last": "Chen", "suffix": ""}, {"first": "F", "middle": ["J"], "last": "Chen", "suffix": ""}, {"first": "Y", "middle": ["H"], "last": "Chen", "suffix": ""}, {"first": "Y", "middle": ["I"], "last": "Lin", "suffix": ""}, {"first": "L", "middle": ["K"], "last": "Siu", "suffix": ""}], "year": 2012, "venue": "J Microbiol Immunol Infect", "volume": "45", "issn": "", "pages": "435--476", "other_ids": {}}, "BIBREF9": {"ref_id": "b9", "title": "Comparison between patients under hemodialysis with community-onset bacteremia caused by community-associated and healthcare-associated methicillin-resistant Staphylococcus aureus strains", "authors": [{"first": "H", "middle": ["S"], "last": "Wu", "suffix": ""}, {"first": "S", "middle": ["C"], "last": "Kuo", "suffix": ""}, {"first": "L", "middle": ["Y"], "last": "Chen", "suffix": ""}, {"first": "M", "middle": ["C"], "last": "Chiang", "suffix": ""}, {"first": "Y", "middle": ["T"], "last": "Lin", "suffix": ""}, {"first": "F", "middle": ["D"], "last": "Wang", "suffix": ""}], "year": 2013, "venue": "J Microbiol Immunol Infect", "volume": "46", "issn": "", "pages": "96--103", "other_ids": {}}, "BIBREF10": {"ref_id": "b10", "title": "Correlation between levofloxacin consumption and the incidence of nosocomial infections due to fluoroquinolone-resistant Escherichia coli", "authors": [{"first": "H", "middle": ["H"], "last": "Wu", "suffix": ""}, {"first": "H", "middle": ["Y"], "last": "Liu", "suffix": ""}, {"first": "Y", "middle": ["C"], "last": "Lin", "suffix": ""}, {"first": "P", "middle": ["R"], "last": "Hsueh", "suffix": ""}, {"first": "Y", "middle": ["J"], "last": "Lee", "suffix": ""}], "year": 2013, "venue": "J Microbiol Immunol Infect", "volume": "", "issn": "", "pages": "", "other_ids": {}}, "BIBREF11": {"ref_id": "b11", "title": "Risk factors associated with nosocomial methicillin-resistant Staphylococcus aureus (MRSA) infection including previous use of antimicrobials", "authors": [{"first": "E", "middle": ["M"], "last": "Graffunder", "suffix": ""}, {"first": "R", "middle": ["A"], "last": "Venezia", "suffix": ""}], "year": 2002, "venue": "J Antimicrob Chemother", "volume": "49", "issn": "", "pages": "999--1005", "other_ids": {}}, "BIBREF12": {"ref_id": "b12", "title": "Methicillin-resistant Staphylococcus aureus and its relationship to antimicrobial use: possible implications for control", "authors": [{"first": "D", "middle": ["L"], "last": "Monnet", "suffix": ""}], "year": 1998, "venue": "Infect Control Hosp Epidemiol", "volume": "19", "issn": "", "pages": "552--561", "other_ids": {}}, "BIBREF13": {"ref_id": "b13", "title": "Relationship between spread of methicillinresistant Staphylococcus aureus and antimicrobial use in a French university hospital", "authors": [{"first": "A", "middle": ["A"], "last": "Muller", "suffix": ""}, {"first": "F", "middle": [], "last": "Mauny", "suffix": ""}, {"first": "M", "middle": [], "last": "Bertin", "suffix": ""}, {"first": "C", "middle": [], "last": "Cornette", "suffix": ""}, {"first": "J", "middle": ["M"], "last": "Lopez-Lozano", "suffix": ""}, {"first": "J", "middle": ["F"], "last": "Viel", "suffix": ""}], "year": 2003, "venue": "Clin Infect Dis", "volume": "36", "issn": "", "pages": "971--979", "other_ids": {}}, "BIBREF14": {"ref_id": "b14", "title": "Selection of high-level oxacillin resistance in heteroresistant Staphylococcus aureus by fluoroquinolone exposure", "authors": [{"first": "R", "middle": ["A"], "last": "Venezia", "suffix": ""}, {"first": "B", "middle": ["E"], "last": "Domaracki", "suffix": ""}, {"first": "A", "middle": ["M"], "last": "Evans", "suffix": ""}, {"first": "K", "middle": ["E"], "last": "Preston", "suffix": ""}, {"first": "E", "middle": ["M"], "last": "Graffunder", "suffix": ""}], "year": 2001, "venue": "J Antimicrob Chemother", "volume": "48", "issn": "", "pages": "375--81", "other_ids": {}}, "BIBREF15": {"ref_id": "b15", "title": "Nosocomial infections due to methicillin-resistant Staphylococcus aureus and vancomycin-resistant enterococci at a university hospital in Taiwan from 1991 to 2003: resistance trends, antibiotic usage and in vitro activities of newer antimicrobial agents", "authors": [{"first": "P", "middle": ["R"], "last": "Hsueh", "suffix": ""}, {"first": "W", "middle": ["H"], "last": "Chen", "suffix": ""}, {"first": "L", "middle": ["J"], "last": "Teng", "suffix": ""}, {"first": "K", "middle": ["T"], "last": "Luh", "suffix": ""}], "year": 2005, "venue": "Int J Antimicrob Agents", "volume": "26", "issn": "", "pages": "43--52", "other_ids": {}}, "BIBREF16": {"ref_id": "b16", "title": "Correlation between antimicrobial consumption and resistance among Staphylococcus aureus and enterococci causing healthcare-associated infections at a university hospital in Taiwan from", "authors": [{"first": "C", "middle": ["C"], "last": "Lai", "suffix": ""}, {"first": "C", "middle": ["Y"], "last": "Wang", "suffix": ""}, {"first": "C", "middle": ["C"], "last": "Chu", "suffix": ""}, {"first": "C", "middle": ["K"], "last": "Tan", "suffix": ""}, {"first": "C", "middle": ["L"], "last": "Lu", "suffix": ""}, {"first": "Y", "middle": ["L"], "last": "Lee", "suffix": ""}], "year": 2000, "venue": "Eur J Clin Microbiol Infect Dis", "volume": "30", "issn": "", "pages": "265--71", "other_ids": {}}, "BIBREF17": {"ref_id": "b17", "title": "CDC/NHSN surveillance definition of health care-associated infection and criteria for specific types of infections in the acute care setting", "authors": [{"first": "T", "middle": ["C"], "last": "Horan", "suffix": ""}, {"first": "M", "middle": [], "last": "Andrus", "suffix": ""}, {"first": "M", "middle": ["A"], "last": "Dudeck", "suffix": ""}], "year": 2008, "venue": "Am J Infect Control", "volume": "36", "issn": "", "pages": "309--341", "other_ids": {}}, "BIBREF18": {"ref_id": "b18", "title": "Nationwide surveillance in Taiwan of the in-vitro activity of tigecycline against clinical isolates of Gram-positive cocci", "authors": [{"first": "S", "middle": ["M"], "last": "Tsao", "suffix": ""}, {"first": "H", "middle": ["C"], "last": "Lin", "suffix": ""}, {"first": "C", "middle": ["M"], "last": "Lee", "suffix": ""}, {"first": "G", "middle": ["J"], "last": "Hsu", "suffix": ""}, {"first": "C", "middle": ["M"], "last": "Chen", "suffix": ""}, {"first": "W", "middle": [], "last": "Sun", "suffix": ""}], "year": 2008, "venue": "Int J Antimicrob Agents", "volume": "32", "issn": "", "pages": "184--191", "other_ids": {}}, "BIBREF19": {"ref_id": "b19", "title": "Daptomycin 98-01 and 99-01 Investigators. The safety and efficacy of daptomycin for the treatment of complicated skin and skinstructure infections", "authors": [{"first": "R", "middle": ["D"], "last": "Arbeit", "suffix": ""}, {"first": "D", "middle": [], "last": "Maki", "suffix": ""}, {"first": "F", "middle": ["P"], "last": "Tally", "suffix": ""}, {"first": "E", "middle": [], "last": "Campanaro", "suffix": ""}, {"first": "B", "middle": ["I"], "last": "Eisenstein", "suffix": ""}], "year": 2004, "venue": "Clin Infect Dis", "volume": "38", "issn": "", "pages": "1673--81", "other_ids": {}}, "BIBREF20": {"ref_id": "b20", "title": "Daptomycin versus standard therapy for bacteremia and endocarditis caused by Staphylococcus aureus", "authors": [{"first": "V", "middle": ["G"], "last": "Fowler", "suffix": ""}, {"first": "H", "middle": ["W"], "last": "Boucher", "suffix": ""}, {"first": "G", "middle": ["R"], "last": "Corey", "suffix": ""}, {"first": "E", "middle": [], "last": "Abrutyn", "suffix": ""}, {"first": "A", "middle": ["W"], "last": "Karchmer", "suffix": ""}, {"first": "M", "middle": ["E"], "last": "Rupp", "suffix": ""}], "year": 2006, "venue": "N Engl J Med", "volume": "355", "issn": "", "pages": "653--65", "other_ids": {}}, "BIBREF21": {"ref_id": "b21", "title": "Wayne: CLSI; 2009. 23. Clinical and Laboratory Standards Institute. Performance standards for antimicrobial disk susceptibility tests: approved standard (Document M2-A9)", "authors": [], "year": 2006, "venue": "", "volume": "", "issn": "", "pages": "", "other_ids": {}}, "BIBREF22": {"ref_id": "b22", "title": "Impact of hospital-wide infection rate, invasive procedures use and antimicrobial consumption on bacterial resistance inside an intensive care unit", "authors": [{"first": "T", "middle": ["S"], "last": "Jacoby", "suffix": ""}, {"first": "R", "middle": ["S"], "last": "Kuchenbecker", "suffix": ""}, {"first": "R", "middle": ["P"], "last": "Santos", "suffix": ""}, {"first": "L", "middle": [], "last": "Magedanz", "suffix": ""}, {"first": "P", "middle": [], "last": "Guzatto", "suffix": ""}, {"first": "L", "middle": ["B"], "last": "Moreira", "suffix": ""}], "year": 2010, "venue": "J Hosp Infect", "volume": "75", "issn": "", "pages": "23--30", "other_ids": {}}, "BIBREF23": {"ref_id": "b23", "title": "Secular trends of healthcare-associated infections at a teaching hospital in Taiwan", "authors": [{"first": "Y", "middle": ["C"], "last": "Chuang", "suffix": ""}, {"first": "Y", "middle": ["C"], "last": "Chen", "suffix": ""}, {"first": "S", "middle": ["C"], "last": "Chang", "suffix": ""}, {"first": "C", "middle": ["C"], "last": "Sun", "suffix": ""}, {"first": "Y", "middle": ["Y"], "last": "Chang", "suffix": ""}, {"first": "M", "middle": ["L"], "last": "Chen", "suffix": ""}], "year": 2010, "venue": "J Hosp Infect", "volume": "76", "issn": "", "pages": "143--152", "other_ids": {}}}, "ref_entries": {"FIGREF0": {"text": "(A) Rates of methicillin-resistant Staphylococcus aureus (MRSA) among S. aureus isolates causing health-careassociated infection (HCAI) and the incidence (per 1000 inpatient-days) of MRSA causing HCAI (HCAI-MRSA). (B) Rates of vancomycin-resistant enterococci (VRE) among enterococcal isolates causing HCAI and the incidence (per 1000 inpatientdays) of VRE causing HCAI (HCAI-VRE).", "latex": null, "type": "figure"}, "FIGREF1": {"text": "Includes vancomycin and teicoplanin. *Statistically significant association (p < 0.05). DDD Z defined daily dose.", "latex": null, "type": "figure"}, "TABREF0": {"text": "Annual consumption of several antimicrobial agents at the National Taiwan University Hospital, 2000e2010", "latex": null, "type": "table", "html": "<html><body><table><tr><td> </td><td> </td><td>Antimicrobial consumption (DDD/1000 patient-days) by year </td><td> </td><td>Trend analysis\n</td></tr><tr><td>Year </td><td>2000 </td><td>2001 </td><td>2002 </td><td>2003 </td><td>2004 </td><td>2005 </td><td>2006 </td><td>2007 </td><td>2008 </td><td>2009 </td><td>2010 </td><td>r </td><td>p\n</td></tr><tr><td>Vancomycin </td><td>19.7 </td><td>19.9 </td><td>23.2 </td><td>26.1 </td><td>24.5 </td><td>21.7 </td><td>20.1 </td><td>19.1 </td><td>20.9 </td><td>18.1 </td><td>17.8 </td><td>0.477 </td><td>0.138\n</td></tr><tr><td>Teicoplanin </td><td>7.7 </td><td>11.8 </td><td>9.1 </td><td>10.0 </td><td>11.9 </td><td>7.9 </td><td>9.0 </td><td>10.1 </td><td>11.7 </td><td>13.1 </td><td>14.5 </td><td>0.619 </td><td>0.042*\n</td></tr><tr><td>Glycopeptidesa </td><td>27.4 </td><td>31.6 </td><td>32.3 </td><td>36.1 </td><td>36.5 </td><td>29.6 </td><td>29.1 </td><td>29.2 </td><td>32.6 </td><td>31.2 </td><td>32.3 </td><td>0.027 </td><td>0.938\n</td></tr><tr><td>Linezolid </td><td>0.0 </td><td>0.0 </td><td>0.2 </td><td>1.2 </td><td>3.0 </td><td>3.1 </td><td>2.9 </td><td>2.6 </td><td>3.3 </td><td>3.9 </td><td>3.1 </td><td>0.775 </td><td>0.014*\n</td></tr><tr><td>Fusidic acid </td><td>0.0 </td><td>0.0 </td><td>3.8 </td><td>6.0 </td><td>5.5 </td><td>4.1 </td><td>3.6 </td><td>4.9 </td><td>4.8 </td><td>2.7 </td><td>3.0 </td><td>0.57 </td><td>0.109\n</td></tr><tr><td>Tigecycline </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>1.8 </td><td>3.7 </td><td>5.0 </td><td>6.0 </td><td>0.847 </td><td>0.153\n</td></tr><tr><td>Daptomycin </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>0.0 </td><td>1.2 </td><td>3.0 </td><td>d </td><td>d\n</td></tr></table></body></html>"}, "TABREF1": {"text": "Correlation between each antibiotic and the density of health-care-associated infection due to methicillin-resistant Staphylococcus aureus", "latex": null, "type": "table", "html": "<html><body><table><tr><td> </td><td>Correlation\n</td></tr><tr><td> </td><td>r </td><td>p\n</td></tr><tr><td>Vancomycin </td><td>0.594 </td><td>0.054\n</td></tr><tr><td>Teicoplanin </td><td>0.700 </td><td>0.017*\n</td></tr><tr><td>Glycopeptides </td><td>0.021 </td><td>0.951\n</td></tr><tr><td>Linezolid </td><td>0.805 </td><td>0.009*\n</td></tr><tr><td>Tigecycline </td><td>0.870 </td><td>0.13\n</td></tr><tr><td>Fusidic acid </td><td>0.519 </td><td>0.153\n</td></tr></table></body></html>"}, "TABREF2": {"text": "Correlation between each antibiotic and the density of health-care-associated infection due to vancomycin-resistant Enterococcus species", "latex": null, "type": "table", "html": "<html><body><table><tr><td> </td><td>Correlation\n</td></tr><tr><td> </td><td>r </td><td>p\n</td></tr><tr><td>Vancomycin </td><td>0.547 </td><td>0.081\n</td></tr><tr><td>Teicoplanin </td><td>0.758 </td><td>0.007*\n</td></tr><tr><td>Glycopeptides </td><td>0.067 </td><td>0.846\n</td></tr><tr><td>Linezolid </td><td>0.593 </td><td>0.092\n</td></tr><tr><td>Tigecycline </td><td>0.976 </td><td>0.024*\n</td></tr><tr><td>Fusidic acid </td><td>0.553 </td><td>0.122\n</td></tr></table></body></html>"}}, "back_matter": [{"text": "The authors declare that they have no financial or nonfinancial conflicts of interest related to the subject matter or materials discussed in the manuscript.", "cite_spans": [], "ref_spans": [], "section": "acknowledgement"}]}