{
    "paper_id": "000d3b13a645c10826aaf2cf0bb0dc18b9580ac2",
    "metadata": {
        "title": "Standort-Info",
        "authors": []
    },
    "abstract": [],
    "body_text": [
        {
            "text": "Die Unterschiede zwischen den Regionen Deutschlands sind immens. So stehen insbesondere altindustrielle Großstädte sowie durch einen hohen Bevölkerungsrückgang gekennzeichnete ländliche Regionen vor zahlreichen Herausforderungen. Zu nennen sind eine geringe Wirtschaftskraft und überdurchschnittliche Armutsquoten, während andere Regionen eine hohe Wirtschaftskraft und hohe Bevölkerungszuwächse verzeichnen.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "IAT erarbeitet Forschungsstudie zur Bewertung ungleicher Lebensverhältnisse"
        },
        {
            "text": "Ein Messkonzept zur Bewertung dieser ungleichen Lebensverhältnisse in den Teilräumen Deutschlands wurde vom Institut Arbeit und Technik ( IAT/Westfälische Hochschule Gelsenkirchen) gemeinsam mit dem Zentrum für interdisziplinäre Regionalforschung ( ZEFIR) an der Fakultät für Sozialwissenschaft der Ruhr-Universität Bochum im Auftrag des Bundesinstituts für Bau-, Stadt-und Raumforschung ( BBSR) entwickelt. Das Messkonzept \"regionaler Lebensverhältnisse\" soll auf Basis objektiver Indikatoren sowie der Erfassung der subjektiven Wahrnehmung regionale Verhältnisse analysieren. Akteure aus Politik, Verwaltung, Wirtschaft und Gesellschaft können damit regional passgenaue Lösungen finden.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "IAT erarbeitet Forschungsstudie zur Bewertung ungleicher Lebensverhältnisse"
        },
        {
            "text": "In dem Modellvorhaben wird ein zweistufiges methodisches Vorgehen vorgeschlagen: In Stufe 1 werden anhand der drei Faktoren \"soziale Lage\", \"Wirtschaftsintensität\" sowie \"Bevölkerungsentwicklung/ Altersstruktur\" die 361 Kreisregionen sieben Gebietstypen zugeordnet.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "IAT erarbeitet Forschungsstudie zur Bewertung ungleicher Lebensverhältnisse"
        },
        {
            "text": "In Stufe 2 erfolgt eine weitergehende Analyse entlang zentraler Dimensionen gleichwertiger Lebensverhältnisse wie Bildung, Gesundheit, Mobilität oder Kommunikation, aber auch \"weiche Faktoren\" wie Engagement oder der soziale Zusammenhalt spielen eine Rolle. Erstmals konnten in dieser Studie Ergebnisse der allgemeinen Lebenszufriedenheit entlang der sieben identifizierten Typen gemessen werden. Der Vorteil dieses Vorgehens liegt darin, dass eine integrierte Betrachtung mehrerer Indikatoren erfolgt und mehrere Herausforderungen einer Region sichtbar werden -etwa hohe Armut, geringere Anteile an Bildungsabschlüssen und geringere Lebenserwartung.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "IAT erarbeitet Forschungsstudie zur Bewertung ungleicher Lebensverhältnisse"
        },
        {
            "text": "Für ein dauerhaftes Raummonitoring gleichwertiger Lebensverhältnisse sollte auch die Datenlage im Be-reich Umwelt und Natur, Kultur-und Freizeit und insbesondere im Hinblick auf die Lebensqualität und das Engagement der Wohnbevölkerung weiter geprüft werden, rät das Forschungsteam. Besonders wünschenswert wäre es, ein breites Datenangebot möglichst kleinräumig verfügbar zu machen -auf Ebene der Gemeinden bzw. nach Verfügbarkeit auch auf der Ebene der innerstädtischen Bezirke. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "IAT erarbeitet Forschungsstudie zur Bewertung ungleicher Lebensverhältnisse"
        },
        {
            "text": "In einem Modellvorhaben der Raumordnung ( MORO) haben sich das Leibniz-Institut für ökologische Raumentwicklung ( IÖR) und Partner mit einem häufig tabuisierten Thema der kommunalen Entwicklung beschäftigt: dem strategischen Rückzug aus kleinen Ortsteilen mit geringer Entwicklungsperspektive. In einem Planspiel wurde ergebnisoffen diskutiert, ob sich Kommunen aus abgelegenen Ortsteilen zurückziehen sollen und wie das funktionieren könnte. Die Ergebnisse sind in einer Handreichung für Kommunen, Heft 15/2020 der Schriftenreihe \" MORO Praxis\", nachzulesen.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Handreichung für Kommunen zu einem Tabusthema"
        },
        {
            "text": "Ein Fazit aus dem MORO \"Anpassung peripherer Siedlungsstrukturen\" ist die Empfehlung an Kommunen, Möglichkeiten eines strategischen Rückzugs ergebnisoffen zu prüfen. Dabei können vier Handlungsoptionen als Starthilfe dienen, die im Rahmen des Modellvorhabens in einem Planspiel thematisiert wurden.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Handreichung für Kommunen zu einem Tabusthema"
        },
        {
            "text": "Mehr als 40 Teilnehmende aus dem gesamten Bundesgebiet -aus kommunaler Politik und Verwaltung, aus Regionalplanung und Kommunalberatunghatten an dem Planspiel teilgenommen. Die Aufgabe bestand darin, in verteilten Rollen einen fiktiven Fall durchzuspielen und zu prüfen, ob und wie der strategische Rückzug aus einem Ortsteil gelingen kann. Das fiktive Areal stand dabei idealtypisch für viele kleine Ortsteile in der Bundesrepublik. Durch Alterung und Abwanderung der Bevölkerung weisen sie einen hohen Leerstand auf und haben zugleich kaum eine Entwicklungsperspektive. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Handreichung für Kommunen zu einem Tabusthema"
        },
        {
            "text": "Die Wissenschaftler erklären das mit Mechanismen aus der Umweltökonomie: Physisches Kapital und Energie lassen sich nur begrenzt gegenseitig ersetzen, was es schwermacht, den Energieverbrauch vom Wirtschaftswachstum zu entkoppeln. Zudem wirken Rebound-Effekte den Einsparungen entgegen. \"Wir können nicht erkennen, dass sich diese Entwicklung ändern wird. Die Gleichung lautet höchstwahrscheinlich weiter: Energieeinsparungen führen an anderer Stelle zu mehr Nachfrage\", erklärt Johanna Pohl von der Technischen Universität Berlin.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Energieeinsparungen erzeugen mehr Nachfrage an anderer Stelle"
        },
        {
            "text": "In Zukunft kann die Digitalisierung nur nachhaltiger werden, wenn sie gezielt für Energieeffizienzsteigerungen eingesetzt wird oder um Sektoren energiesparend zu verändern. Gleichzeitig müssten aber auch Maßnahmen greifen, die den Energiebedarf des Sektors selbst eindämmen und Rebound-und Wachstumseffekten entgegensteuern. \"Aber selbst dann würden die Energiespareffekte der Digitalisierung nicht ausreichen, um die Klimaschutzziele zu erreichen. Wir müssen noch einen Schritt weitergehen und daran arbeiten, die digitalen Möglichkeiten in den Dienst einer ökologischen Transformation der Ökonomie zu stellen\", so Steffen Lange vom IÖW. \"Anstatt die Nebenwirkungen der Digitalisierung zu bekämpfen, sollten alle ökonomischen Sektoren transformiert werden, insbesondere Industrie, Landwirtschaft, Energie, Bau und Verkehr. Hierbei könnten digitale Technologien -richtig eingesetzt -eine wichtige Rolle spielen.\"",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Energieeinsparungen erzeugen mehr Nachfrage an anderer Stelle"
        },
        {
            "text": "Die Forschungsgruppe \"Digitalisierung und sozial-ökologische Transformation\" untersucht die Chancen und Risiken der Digitalisierung für eine Verringerung der Energie-und Ressourcenverbräuche und erarbeitet Ansätze für die politische und gesellschaftliche Gestaltung der Digitalisierung, damit sie zum notwendigen Wandel der Gesellschaft in Richtung Nachhaltigkeit beiträgt. Die Forschungsgruppe wird vom Bundesministerium für Bildung und Forschung ( ",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 448,
                    "end": 449,
                    "text": "(",
                    "ref_id": null
                }
            ],
            "section": "Energieeinsparungen erzeugen mehr Nachfrage an anderer Stelle"
        },
        {
            "text": "Eine neue interaktive Anwendung des Bundesinstituts für Bau-, Stadtund Raumforschung ( BBSR) \"Corona regional\" veranschaulicht, wie sich COVID-19 in Deutschland regional ausgebreitet hat. Auch die mit der Infektionskrankheit zusammenhängende Belegung von Intensivbetten können Nutzerinnen und Nutzer abrufen.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Interaktive Anwendung des BBSR zur regionalen Ausbreitung von COVID-19"
        },
        {
            "text": "Die Anwendung ermöglicht es Interessierten, die Fallzahlen der Pandemie in für die Raumplanung wichtigen Zusammenhängen nachzuvollziehen, beispielsweise in städtischen und ländlichen Räumen, für administrative und siedlungsstrukturelle Einheiten wie Bundesländer und Landkreise oder für bestimmte Bevölkerungsindikatoren. Sie zeigt, welche Räume wie stark von der Pandemie betroffen waren und wie Hotspots die Fallzahlen einer Region beeinflussen. Kreis-und Streudiagramme, \"Heatmaps\" (Entwicklung der Fallzahlen im Vergleich) und Liniendiagramme (\"Fieberkurven\") veranschaulichen die Entwicklung. Regionale Analysen sind auch für verschiedene Altersgruppen und differenziert nach Geschlechtern möglich. \"Corona regional\" zeigt: Zwar waren und sind einige dünner besiedelte Regionen weniger betroffen als dicht besiedelte Gebiete. Ein systematischer Unterschied zwischen den einwohnerbezogenen COVID-19-Fallzahlen in Stadt und Land kann jedoch nicht festgestellt werden. Unterschiede bei regionalen Erkrankungs-und Todeszahlen lassen sich nicht nur auf lokale Hot-spots mit vielen Infizierten zurückführen. Auch andere Faktoren wie etwa die Altersstruktur der Bevölkerung in der Region spielen eine Rolle. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Interaktive Anwendung des BBSR zur regionalen Ausbreitung von COVID-19"
        },
        {
            "text": "Der Wolf ist in Deutschland eine streng geschützte Art. Bislang durften die Tiere nicht bejagt werden. Im November 2019 wurde das Bundesnaturschutzgesetz geändert: In Ausnahmefällen ist nun die Tötung von Wölfen, die wiederholt Nutztiere reißen, erlaubt. Vor diesem Hintergrund hilft der Bewertungsrahmen lokalen Behörden, Schadensfälle je nach Situation objektiv einzuschätzen und zu entscheiden, ob die Tötung eines Wolfs notwendig ist. In die Analyse fließen die Ansichten verschiedener Interessensgruppen, zum Beispiel aus dem Naturschutz und der Landwirtschaft, mit ein. \"Der Bewertungsrahmen bietet eine wissenschaftlich fundierte Grundlage, Konflikten zwischen der Landwirtschaft und dem Wolf vorzubeugen und im Schadensfall angemessen zu handeln\", erklärt Hannes König. Das Instrument der Jagd auf Wölfe soll Tierhalter unterstützen, aber nur in Notfällen eingesetzt werden. Wie König betont, sind Landwirt*innen aufgerufen, stattdessen konsequent Schutzmaßnahmen wie Elektrozäune und Herdenschutzhunde einzusetzen, um zu verhindern, dass der Wolf Schafe, Ziegen oder andere Nutztiere reißt.",
            "cite_spans": [
                {
                    "start": 764,
                    "end": 777,
                    "text": "Hannes König.",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Jeden Fall überprüfen und überlegt handeln"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "1; zur Arbeit der Nachwuchsforschungsgruppe \"Mensch-Wildtierkonflikte in Agrarlandschaften",
            "authors": [
                {
                    "first": "H J",
                    "middle": [],
                    "last": "König",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Kiffner",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Kramer-Schadt",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Fürst",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Keuling",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Ford",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Weitere Informationen: zur Änderung des Bundesnaturschutzgesetzes",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "https:/conbio.onlinelibrary.wiley.com/doi/full/10.1111/cobi.13513"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Landnutzung und Governance",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Hannes",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "König",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Der Anblick eines Wolfs in freier Wildbahn erzeugt die unterschiedlichsten Reaktionen. Die Nachwuchsforschungsgruppe um Hannes Koenig ( ZALF) untersucht, wie Konflikte zwischen Menschen und Wildtieren minimiert werden können",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Download: https://www.bbsr.bund.de/ BBSR/ -DE/veroeffentlichungen/bbsr-online/2020/bbsronline-06-2020.html. Wissenschaftliche Ansprechpartnerin: Elke Dahlbeck, Tel.: 0209/17 07 -331, E-Mail: dahlbeck@iat.eu. BBSR Gebietstypisierung Kreisregionen 2017 Datenbasis BBSR 2019; Geobasis DE/ BKG 2017",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "Vor allem in ländlichen und strukturschwachen Gegenden in Ost wie West finden sich diese abgelegenen Ortsteile. Sie stellen Kommunen spätestens dann vor die Frage, wie mit ihnen umzugehen ist, wenn Investitionen in marode technische Infrastrukturen wie Straßen, Kanalisation oder Trinkwasserleitungen nicht mehr aufzuschieben sind. Hohe Kosten stehen dann den wenigen verbliebenen Einwohner*innen gegenüber. Wäre es in dieser Situation vorstellbar, dass die Ge-Fokus: das Bauund Planungsrecht, die Kosten eines Rückzugs sowie die sozialen und emotionalen Aspekte in der Gemeinde. Vier grundsätzliche Handlungsoptionen wurden herausgearbeitet: kein strategischer Rückzug, also der Erhalt des Ortsteiles; ein sehr langsamer strategischer Rückzug; ein forcierter, vollständiger Rückzug sowie ein forcierter, aber nur teilweiser Rückzug. Letzterer würde voraussetzen, dass die verbleibenden Einwohner*innen die Infrastrukturen wie Straßen, Abwasseranlagen und Müllentsorgung in privater Trägerschaft, etwa in Form einer Genossenschaft, übernehmen. Die Vor-und Nachteile der vier Optionen wurden im Planspiel und in einem Begleitkreis ausführlich diskutiert. Einige Spielgruppen entschieden sich tatsächlich für einen vollständigen Rückzug. Allerdings herrschte bei einzelnen Teilnehmenden auch Skepsis, ob sich ein solches Vorgehen in der Realität wirklich kommunalpolitisch umsetzen ließe. Die Diskussionen zu den verschiedenen Rückzugsoptionen werden in einer Handreichung für Kommunen nun ausführlich dargestellt, Vor-und Nachteile sowie wichtige Voraussetzungen beleuchtet. Auch zu den Kosten eines strategischen Siedlungsrückzugs enthält die Broschüre Informationen. Sie spielen eine wichtige Rolle, sind doch hohe Pro-Kopf-Kosten für Infrastrukturen häufig Auslöser und wichtige Leerstand und wenig Entwicklungsperspektive -wann ist ein Siedlungsrückzug sinnvoll? Begründung eines strategischen Rückzugs. Doch das Planspiel hat auch gezeigt: Mittelfristig können die Kosten für den strategischen Rückzug diejenigen für den Erhalt des Ortsteiles sogar übersteigen. Ein wichtiger Punkt in der Diskussion zum Thema ist deshalb auch die Frage nach geeigneten Rechts-und Förderinstrumenten vonseiten des Gesetzgebers. Das Projekt-Team empfiehlt, das vorhandene Instrumentarium hin zu einem Instrument \"Ländlicher Umbau\" weiterzuentwickeln. Die namentliche Anlehnung an das Instrumentarium zum Stadtumbau sei dabei bewusst gewählt, denn viele Herausforderungen und Lösungspfade ähnelten sich in Stadt und Land. Bei der Entwicklung von Rechts-und Förderinstrumenten müssten aber auch die Besonderheiten der ländlichen Räume, etwa der hohe Anteil selbstgenutzten Eigentums, berücksichtigt werden. Weitere Erkenntnisse aus dem MORO-Planspiel, die es zu berücksichtigen gilt: Ein strategischer Rückzug ist keine Sofortmaßnahme, sondern braucht Zeit -im Vorlauf, in der Vorbereitung und in der Umsetzung. Das Thema ist äußerst komplex, betroffene Kommunen benötigen daher oft umfassende fachliche Unterstützung. Nicht zuletzt handelt es sich um ein hochemotionales Thema. Eine umfassende Beteiligung der betroffenen Menschen vor Ort und eine transparente Gestaltung des Prozesses sind daher äußerst wichtig.Studie belegt: Bisher Fehlanzeige",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Mail: steffen.lange@ioew.de. Bibliografische Informationen zum Journal-Artikel: https:// doi.org/10.1016/j.ecolecon.2020.106760. Weitere Informationen: http://www.nachhaltigedigitalisierung.de; http://www.ioew.de.",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "Die Corona-Pandemie verschlechtert dramatisch die Finanzlage der Kommunen in Deutschland und bedroht ihre Investitionsfähigkeit. Auch über 2020 hinaus brauchen die Kommunen Zusagen von Bund und Ländern für weitere Unterstützung in Milliardenhöhe. Nur dann können sie auch erfolgreich zur Stabilisierung der Konjunktur beitragen. Ohne weitere Hilfen wird es hingegen vielen Kommunen unmöglich sein, notwendige Investitionen zu tätigen und den bestehenden Investitionsstau weiter abzubauen. Zu diesen Ergebnissen kommt eine gemeinsame Studie des ZEW Mannheim und des Deutschen Instituts für Urbanistik (Difu) im Auftrag des Deutschen Städtetages. Zentrale Ergebnisse der Studie: • In Folge der Corona-Pandemie und des daraus resultierenden wirt-Gemeldete COVID-19-Fälle pro Tag je 100.000 Einwohner im Zeitverlauf Bund und Länder müssen nach der Steuerschätzung schnell die Frage beantworten, was die Kommunen mittelfristig stabilisiert. Der Bund übernimmt zwar für 2020 die Gewerbesteuerausfälle und will sich dauerhaft stärker an den Kosten der Unterkunft bei der Grundsicherung für Arbeitsuchende beteiligen. Beides ist gut. Doch damit allein lässt sich ein Einbruch der kommunalen Investitionen in den kommenden Jahren nicht verhindern. Nötig sind Zusagen von Bund und Ländern für eine Unterstützung über 2020 hinaus. Und wir brauchen ein Begleitprogramm für besonders krisengefährdete Kommunen, damit nicht gerade in den Städten die Investitionen besonders stark wegbrechen, wo sie am nötigsten sind\", so Städtetags-Hauptgeschäftsführer Helmut Dedy abschließend. Deutschlandüberblick: Resilienz und erwartete Kriseninzidenz -Resilienz und Kurzarbeit Die Arbeitshilfe und ergänzende Materialien sind online abrufbar: https://www.ioer.de/projekte/urban-nbs/. Internetseite des Projektes: http://urban-nbs.de/. Kontakt im IÖR: Dr. Juliane Mathey, E-Mail: J.Mathey@ioer.de. Ort auswirken, sei nur noch schwer nachzuvollziehen. \"Das stellt besonders kleine und mittlere Unternehmen vor große Herausforderungen\", erklärt Prof. Dr. Martin Franz, Projektleiter vom Institut für Geographie der Universität Osnabrück. \"Ihre Lieferketten lassen sich nur schwer strategisch koordinieren. Außerdem gelingt es nur selten, das bereits existierende Wissen über die Produktionsbedingungen an die Kunden zu vermitteln.\" Im Vorhaben will das Forschungsteam sichtbar Um das herauszufinden, wollen sie Konsumenten befragen sowie Experimente im Labor und im Feld durchführen. Zudem sollen Virtual Reali-ty-Technologien eingesetzt werden, um die soziale und räumliche Distanz zwischen den Konsumenten in Deutschland und den Produzenten in Ghana zu verringern. Das Projekt weise daher neben den umweltbezogenen dbu.de/123artikel38756_2442.html. Kontakt: Prof. Dr. Martin Franz, Tel. 0541/969 42 77, E-Mail: martin.franz@uni-osnabrueck.de. Was Kommunen tun können In Städten werden große Mengen an Treibhausgasen in den Bereichen Energie, Gebäude, Verkehr sowie Gewerbe und Industrie ausgestoßen. Um das Klima zu schützen, spielen Kommunen daher eine wichtige Rolle. Rund ein Viertel der Kommunen in Deutschland gilt allerdings schon seit Jahren als finanzschwach. Dass gerade auch diese Städte und Gemeinden Spielräume für Klimaschutzinvestitionen haben und davon regionalökonomisch profitieren können, zeigen eine neue Broschüre und fünf ergänzende Infoblätter vom Deutschen Institut für Urbanistik Beim Ernten der frischen Kakaofrüchte wird meist wenig auf Umwelt und Gesundheit der Kleinbauern geachtet. Das soll sich mit Hilfe des Projektes ändern Kommunen -setzen nicht nur einen fachübergreifenden und strategischen Dialog zwischen Umwelt-, Bau-und Finanzdezernaten in den jeweiligen Städten voraus. Städte müssen auch offensiv in den Dialog mit den für sie zuständigen Aufsichtsbehörden der jeweiligen Bundesländer treten\", sagt Corinna Altenburg vom Difu. Die Broschüre und die Infoblätter helfen (finanzschwachen) Kommunen über Anfangshürden bei der Projektarbeit für den Klimaschutz hinweg. Sie zeigen Beispiele aus der kommunalen Praxis auf und verweisen auf umfangreiche weiterführende Informationen. So können sich interessierte Akteur*innen aus Kommunen etwa über die Finanzierung und Umsetzung von Maßnahmen informieren. Rolle und Handlungsbereiche von Kommunen im Klimaschutz. (Difu-eigene Darstellung, erweitert und ergänzt in Anlehnung an Difu 2017) Die unzähligen Proben und Daten von der einjährigen Drift seien ein Geschenk an die ganze Menschheit. Jetzt komme es darauf an, das neue Wissen zu nutzen, um richtige Entscheidungen zu treffen -für die Zukunft der Arktis und für die Zukunft unseres Planeten. Gesunde Nahrungsmittel, Biodiversitätsschutz, Nitratbelastung -viel wurde in den letzten Jahren über die Probleme in der Landwirtschaft diskutiert und über mögliche Lösungsansätze gestritten. Innovative und akzeptierte Lösungen sind gefragt, die alle Akteure mit einbeziehen -was nicht zuletzt die Aktivitäten von Fridays for Future oder die Proteste von Landwirt*innen gegen die politische Verschärfung der Umweltauflagen Anfang dieses Jahres gezeigt haben. Hier knüpfen die \"Agrarsysteme der Zukunft\" an, eine Förderinitiative des Bundesforschungsministeriums ( BMBF). Acht inter-und transdisziplinäre Forschungskonsortien suchen nach Antworten und verfolgen dabei zum Teil auch unkonventionelle Lösungsansätze für die Zukunft der Landwirtschaft. Vorausgegangen war der \"Zukunftsprozess Agrarsysteme -Ideen für eine lebenswerte Zukunft\" ab 2015, mit dem der Startschuss für das Förderformat und die Identifikation relevanter Forschungs-und Innovationsfelder erfolgte. Beim offenen \"Wettbewerb der Visionen\" kamen Akteure aus Wissenschaft, Wirtschaft, Gesellschaft und Politik zusammen, um Ideen und Zukunftsbilder für zukünftige Agrarsysteme zu diskutieren. Auf der Grundlage von Zukunftsvisionen und weiteren inhaltlichen Arbeiten entstand die 2016 veröffentlichte BMBF-Fördermaßnahme.Viele Wege -ein gemeinsames ZielDie acht geförderten Forschungskonsortien befassen sich mit unterschiedlichen Themenbereichen von Ernährung der Zukunft über Landwirtschaft 4.0, Grünlandnutzung bis hin zu stadtregionalen Kreisläufen. Dabei verbinden sie nicht nur unterschiedliche wissenschaftliche Disziplinen, sondern beziehen auch eine große Bandbreite verschiedener Praxisakteure mit ein. Um den Transfer aus der Wissenschaft in die Praxis zu erproben, haben die Projekte konkrete Umsetzungsschritte vorgesehen, in denen die wissenschaftlichen Erkenntnisse direkt zur Anwendung kommen. Dabei verteilen sich die Projekte über ganz Deutschland und decken somit auch unterschiedliche naturräumliche Gegebenheiten ab.Die Konsortien arbeiten in unterschiedlichen räumlichen Kontexten. Die Projekte \"Fahrerkabine 4.0\" und \"NOcsPS\" stellen das Wirtschaften in ländlichen Räumen in den Mittelpunkt. Fahrerkabine 4.0 untersucht, wie eine smarte Fahrerkabine bei Landmaschinen die hohe Arbeitsbelastung der Landwirt*innen verringern kann. Das Projekt NOcsPS setzt sich mit der Verknüpfung von ökologischem und konventionellem Landbau auseinander. Gesucht wird nach modifizierten Ackerbausystemen, um in Zukunft auf den Einsatz von chemisch-synthetischen Pflanzenschutzmitteln verzichten zu können. Auch urbane Räume sind ein wichtiger Bestandteil der Untersuchungen. So werden bei \" CUBES-Circle\" nicht nur besonders für Städte geeignete, in sich geschlossene modulare Anbausysteme erprobt, in \"food4future\" werden auch mögliche Produktionssysteme für die Kultivierung alternativer Nahrungsquellen wie Makroalgen, Halophyten (salztolerante Pflanzen), Medusen (Quallen) und Grillen erforscht.Die Projekte \" RUN\" und \" SUSKULT\" schlagen eine Brücke zwischen diesen beiden Räumen und wollen Kreisläufe schließen, indem sie die in urbanen Räumen entstehenden Nährstoffe für die Nahrungsmittelproduktion nutzbar machen. Dabei geht es auf der einen Seite um die Gewinnung von Nährstoffen aus Bioabfällen und Abwasserströmen, während auf der anderen Seite die entstehenden Ressourcen einer Kläranlage für eine angrenzende Agrarproduktion zugänglich gemacht werden sollen.Neben physischen Räumen spielen auch virtuelle Räume eine wichtige Rolle. Mit Hilfe innovativer Tierlenktechnologie bringt das Projekt \"Green-Gras\" virtuelle und physische Räume zusammen. Ermöglicht werden soll das Hüten von Weidetiere ohne Zäune, um die Weidehaltung langfristig wieder attraktiver für Landwirt*innen zu machen. Das Projekt \" DAKIS\" bewegt sich im virtuellen Raum, indem es ein digitales Wissens-undInformationssystem für die Landwirtschaft erarbeitet. Das System, das Echtzeitdaten mit Simulationen, gesellschaftlichen Bedarfen und betriebsökonomischen Faktoren kombiniert, soll in Zukunft Ökosystemleistungen optimal für die Gesellschaft bereitstellen können. So entstehen neue Kommunikationswege für eine Kooperation zwischen Landwirt*innen, Verbraucher*innen und der Gesellschaft. Die Projekte untersuchen unterschiedliche Formen von Produktions-und Reproduktionsräumen. Somit geht es nicht nur um die unterschiedlichen Produktionsformen von Nahrungsmitteln, sondern auch um vielfältige Möglichkeiten der Wiedernutzung von Nährstoffen. Die Etablierung und dauerhafte Umsetzung von Kreislaufwirtschaftssystemen bildet hier die konzeptionelle Grundlage. \"Die Agrarsysteme der Zukunft bieten neue Perspektiven und Ansätze für ein zukunftsweisende Landwirtschaft und eine nachhaltige Bioökonomie\" so Prof. Monika Schreier, Teil der Koordinierungsstelle und Koordinatorin des Projekts food4future. Dabei steht der Weg von der innovativen Idee bis hin zur Umsetzung im Zentrum der Projekte. Wesentlich sind hierfür interund transdisziplinäre Formen der Zusammenarbeit. Die Aktivitäten stehen dabei ganz im Zeichen der diesjährig verabschiedeten nationalen Bioökonomiestrategie der Bundesregierung, gezielt nachhaltige Lösungen zu entwickeln, die Ressourcen schonen und gleichzeitig Wohlstand schaffen. Weitere Informationen unter: www.agrarsysteme-der-zukunft.deZALF-Entscheidungshilfen für den Umgang mit Wildtieren in der LandwirtschaftDas Leibniz-Zentrum für Agrarlandschaftsforschung ( ZALF) e. V. untersucht im Rahmen einer Nachwuchsforschergruppe, wie sich Konflikte zwischen Wildtieren und Menschen in der Landwirtschaft reduzieren lassen. In der Zeitschrift \"Conservation Biology\" stellen ZALF-Forschende nun einen Bewertungsrahmen vor, der Behörden und Politik im Umgang mit dem Wolf besser unterstützen soll.Landwirtschaftlich genutzte Flächen sind immer auch Lebensraum. Wenn Wildtiere auf Feldern ihre Nahrung suchen oder Nutztiere auf Weiden reißen, kann das für landwirtschaftliche Betriebe zum Problem werden. Das konfliktträchtigste Beispiel ist wohl der Wolf. Mehr als 100 Rudel sind seit dem Jahr 2000 wieder in Deutschland heimisch. Die Wissenschaftler*innen der Nachwuchsforschungsgruppe \"Mensch-Wildtierkonflikte in Agrarlandschaften\" am ZALF wollen herausfinden, wie sich in der Landwirtschaft das Risiko für durch Wildtiere verursachte Schäden vermeiden lässt. In Zusammenarbeit mit Forschungseinrichtungen aus Deutschland, Tansania und Kanada hat die Gruppe um den Leiter Dr. Hannes König einen wissenschaftlichen Bewertungsrahmen erarbeitet, der dabei unterstützen soll, durch Wölfe verursachte Schäden zukünftig besser einzuschätzen und Entscheidungshilfen für geeignete Maßnahmen bereitzustellen.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "Zur Vernetzung der einzelnen Forschungsprojekte wurde ein Koordinierungskreis aus den Koordinator*innen der einzelnen Forschungskonsortien und dem Mittelgeber gebildet. Dem Koordinierungskreis zur Seite gestellt ist die durch das IGZ (Leibniz Institut für Gemüse-und Zierpflanzenbau) und das ZALF (Leibniz-Zentrum für Agrarlandschaftsforschung) realisierte Koordinierungsstelle. Sie fördert gezielt den Austausch zwischen den Projekten durch strategische Workshops, initiiert neue Kooperationen und realisiert die projektübergreifende Außenkommunikation. Zudem ist sie für die Strategiebegleitung und Weiterentwicklung der Forschungs-und Umsetzungsstrategien der Konsortien zuständig. Im Rahmen der ersten Statuskonferenz wurden so erste Verbindungslinien zwischen den Projekten identifiziert sowie mögliche Formen der Kooperation erarbeitet. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Vernetzung und Perspektiven"
        }
    ]
}