{
    "paper_id": "000ee7a319f964af24836e5b0402cc7576edff6d",
    "metadata": {
        "title": "Journal of Adolescent Health xxx (2020) 1e2 Letter",
        "authors": []
    },
    "abstract": [],
    "body_text": [
        {
            "text": "Letter to the editor Lessons Learned: Achieving Critical Mass in Masking Among Youth in Congregate Living",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Covenant House is a nonprofit organization that provides housing and support services to youth facing homelessness. Homeless services are provided in congregate settings, which can facilitate the spread of infection. Recommendations to prevent COVID-19 may be difficult for a person experiencing homelessness to follow. For many, it is not possible to avoid crowded locations, such as shelters. However, once sheltered, some measures become more feasible, such as frequent handwashing with soap and water and wearing a face mask. Maintaining a distance of six feet from others may be more or less feasible depending on the limitations of spacing at the shelter but can be addressed with processes that make it possible. Covenant House staff members have been tirelessly working to maintain standard measures to protect our youth and to be able to sustain the shelters' mission during this unprecedented time.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "To the Editors:"
        },
        {
            "text": "We serve at the health center within the Covenant House of Pennsylvania. Our first programmatic changes related to COVID-19 transmission were made in early March. While presented sequentially, many of our efforts happened simultaneously. Each new effort was introduced as it was developed with often overlapping time frames. We tried to minimize crowds by expanding mealtime and shower hours, thereby allowing fewer residents into those spaces at any time. We expanded access to hand sanitizers and required all youth to sanitize before entering public spaces. When we asked youth to abide by universal masking, many were initially resistant. Committed to avoiding punitive measures for youth not wearing their masks, we focused on methods of positive reinforcement. Our efforts were based on a diffusion of innovation model which has been successfully used with adolescents and young adults to achieve behavioral change [1e4] .",
            "cite_spans": [
                {
                    "start": 921,
                    "end": 926,
                    "text": "[1e4]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "To the Editors:"
        },
        {
            "text": "A new idea is adopted slowly during the early stages of the diffusion process until a critical mass of early adopters is achieved [1e3]. We first worked to encourage staff to wear masks and, within a couple of weeks, mandated usage. We created posters of staff and celebrities wearing masks and placed them in public locations, but adult modeling had minimal impact on the youth. We took an informal poll to assess how the youth felt about masking and perceived barriers and made changes using the philosophy of rapid process innovation. Surgical masks, which were first available and recommended, were considered the most invasive, uncomfortable, and disruptive of all the interventions. Lack of personal experience with COVID-19, misinformation about their own susceptibility, conspiracy rumors, and general mistrust of government made it difficult for youth to appreciate real risks or the protective benefits of masking. In response, we set out to educate our youth and created customizable pins with the statement \"I wear my mask for.\" and distributed them around the shelter. We tried to harness the protective nature and compassion of the youth as motivation to adopt this new behavior change. The pins yielded few new adopters.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "To the Editors:"
        },
        {
            "text": "Diffusion of innovation theory depends on early adopters' perception of the innovation as advantageous [1, 4] . We were able to identify an early adopter in shelter who was considered a leader among her peers. We met with her in the middle of March to better understand her motivations. She suggested that we allow the youth to decorate their masks, a subtle gesture that would celebrate individuality. We created a mask training session for the residents and provided them with space and materials to decorate the masks. We saw some improvement in the rate of adoption as our early adopter shared her positive experiences with other residents. However, by the end of March, we still had a minority of youth complying with universal masking.",
            "cite_spans": [
                {
                    "start": 103,
                    "end": 106,
                    "text": "[1,",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 107,
                    "end": 109,
                    "text": "4]",
                    "ref_id": "BIBREF3"
                }
            ],
            "ref_spans": [],
            "section": "To the Editors:"
        },
        {
            "text": "In mid-April, a little over 6 weeks after we began our initial efforts, we reached a critical mass. Cloth masks were introduced as an option for the youth, largely made possible by the charitable contributions of local donors. The cloth masks allowed residents the opportunity to express their personal styles. Here we saw the biggest change thus far in the rate of adoption. It was, however, the eventual donation of masks with the logos of Philadelphia sports teams that enabled us to reach our critical mass. This provided youth with the ability to champion their home sports team in a way similar to wearing a jersey or baseball cap while abiding by universal masking. We are now proudly at a point where on average about three-quarters of the residents wear their masks at any time while inside the shelter. We are aware that cloth masks do not offer the same protection as surgical masks but do decrease transmission rates. Nevertheless, the lesson we would draw from this process is that we would start next time with the decorative cloth masks e and be well supplied with team logos e to engage more early adopters.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "To the Editors:"
        },
        {
            "text": "At Covenant House, we were faced with a nearly impossible mission of staying true to our core values during this www.jahonline.org pandemic. How do we keep our doors open to youth in need of shelter, support, and loving-kindness, while closing the doors to the virus in order to keep those inside safe and protected? Our open-door policy was perhaps what we both valued and feared most. What we discovered through our efforts is not a surprise to those familiar with adolescents. Diffusion of innovation, in this case universal masking, is largely dependent on the influence of early adopters [1, 2] . We also know that perceptions about peer behaviors motivate change [5] . Decisions made in adolescence are intimately bound to social context and the perception of normative behaviors. Once we reached critical mass in our universal masking, youth perception of peer behavior shifted and redefined what was considered normative. Innovations that involve a behavior change among youth need early adoption from a few prominent individuals. However, we must accept the power of peer influence and use it to our advantage, by first learning from youth what attracts and engages them. ",
            "cite_spans": [
                {
                    "start": 593,
                    "end": 596,
                    "text": "[1,",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 597,
                    "end": 599,
                    "text": "2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 669,
                    "end": 672,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "To the Editors:"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Behavioral interventions for prevention and control of sexually transmitted diseases",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "S"
                    ],
                    "last": "Lawrence",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "D"
                    ],
                    "last": "Fortenberry",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "23--59",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "HIV risk behavior reduction following intervention with key opinion leaders of population: An experimental analysis",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "A"
                    ],
                    "last": "Kelly",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "S"
                    ],
                    "last": "St Lawrence",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [
                        "E"
                    ],
                    "last": "Diaz",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Am J Public Health",
            "volume": "81",
            "issn": "",
            "pages": "168--71",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "The mpowerment project: A communitylevel HIV prevention intervention for young gay men",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Kegeles",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "B"
                    ],
                    "last": "Hays",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "J"
                    ],
                    "last": "Coates",
                    "suffix": ""
                }
            ],
            "year": 1996,
            "venue": "Am J Public Health",
            "volume": "86",
            "issn": "",
            "pages": "1129--1165",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "HIV immunization: Acceptability and anticipated effects of sexual behavior among adolescents",
            "authors": [
                {
                    "first": "P",
                    "middle": [
                        "M"
                    ],
                    "last": "Webb",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "D"
                    ],
                    "last": "Zimet",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Mays",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "D"
                    ],
                    "last": "Fortenberry",
                    "suffix": ""
                }
            ],
            "year": 1999,
            "venue": "J Adolesc Health",
            "volume": "25",
            "issn": "",
            "pages": "320--322",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Early sexual initiation: The role of peer norms",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "B"
                    ],
                    "last": "Kinsman",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Romer",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "F"
                    ],
                    "last": "Furstenberg",
                    "suffix": ""
                }
            ],
            "year": 1998,
            "venue": "Pediatrics",
            "volume": "102",
            "issn": "",
            "pages": "1185--92",
            "other_ids": {}
        }
    },
    "ref_entries": {},
    "back_matter": []
}